
import { SiteData } from './types';

export const FOLLOWER_USERNAME = "متابع";
export const FOLLOWER_PASSWORD = "101001000";
export const ADMIN_USERNAME = "مسؤول";
export const DEFAULT_ADMIN_PASSWORD = "123456";

export const INITIAL_DATA: SiteData = {
  offers: {
    "115": [
      {
        title: "العرض الاول لزون 115 الخاص بالاعمدة (1 / 2 / 3 / 4 / 5 / 6 / 7 / 8 / 9 / 10 / 11 / 12 / 13 / 39)",
        table: [
          ["شهر", "15,000", "20,000", "30,000", "75,000"],
          ["ثلاث اشهر", "55,000", "75,000", "120,000", "180,000"]
        ],
        note: "العرض الأول (بدون سوبرسيل): الكيبل مجاني | الجهاز الضوئي بـ5,000 | الڤيلان : 710"
      },
      {
        title: "العرض الثاني لزون 115 الخاص بالاعمدة (14 / 15 / 16 / 18 / 19 / 22 / 23 / 24 / 25 / 26 / 28 / 30 / 32 / 34 / 35 / 36 / 37 / 38 / 41)",
        table: [
          ["شهر", "15,000", "20,000", "30,000", "75,000"],
          ["شهرين", "مجاني", "لايوجد", "لايوجد", "لايوجد"],
          ["ثلاث اشهر", "20,000", "75,000", "120,000", "180,000"]
        ],
        note: "العرض الثاني (مُشترك مع سوبرسيل): الكيبل مجاني | الجهاز الضوئي 5,000 | الڤيلان : 710"
      }
    ],
    "سوبر سيل حكومي": [{
      title: "عرض سوبر سيل حكومي",
      table: [
        ["شهر", "38,000", "48,000", "68,000", "غير متوفر"],
        ["3 أشهر", "غير متوفر", "غير متوفر", "غير متوفر", "غير متوفر"],
      ],
      note: "السرعات المذكورة تشمل اشتراكات الوطني فقط | الكيبل بـ10,000 | الجهاز الضوئي بـ10,000 | الڤيلان : 10",
    }],
  },
  maps: [
    {
      name: "وطني الدور",
      link: "https://www.google.com/maps/d/edit?mid=1ZLaIWvkNGXWzXBtS2qn3QnuICsF4MLw",
    },
  ],
  vlans: {
    "151": "210",
    "235": "317",
    "مجمع": "2",
  },
  materials: {
    routers: [
      {
        name: "راوتر TP-link BE3000 Wifi 7",
        price: "السعر : 90.000 د.ع",
        image: "https://dc585.4shared.com/img/5YBFGXfZfa/s24/1993358aed0/_TP-link_BE3000_Wifi_7?async&rand=0.8962375215610101",
        specs: [
          "Wifi : الجيل السابع (الاحدث والاسرع) (Wifi 7)",
          "التغطية: ممتازة للمنازل المتوسطة إلى الكبيرة مع 4 هوائيات خارجية قوية",
          "السرعة: السرعة سلكياً : منفذ WAN بسرعة 2.5G و4 منافذ LAN المنفذ الأول بسرعة 2.5G والمنافذ الثلاث الباقية بسرعة 1G || السرعة الاسلكية : تصل تقريباً 3000Mbps  (574Mbps على 2.4GHz و2402Mbps على 5GHz).",
          "تحمّل الأجهزة: يدعم MU-MIMO، Beamforming وWPA3، لتوزيع أفضل للإشارة على أجهزة متعددة وتقليل التداخل.",
          " للألعاب والبث: أداء فائق جدًا للبث بدقة 4K وألعاب أونلاين بدون لاكَ أو تقطيع بفضل خاصية MOL و OFDMA ."
        ],
      },
    ],
    onu: [],
    ont: [],
    other: [],
  },
  columns: {
    areas: [
      {
        name: "الدور",
        zones: [
          {
            number: "50",
            poles: [
              { number: 1, connected: 5, moved: 2, notes: "ملاحظات حول العمود 1" },
              { number: 2, connected: 3, moved: 1, notes: "ملاحظات حول العمود 2" },
            ]
          },
          {
            number: "51",
            poles: [
              { number: 1, connected: 4, moved: 0, notes: "ملاحظات حول العمود 1" },
            ]
          }
        ]
      },
      {
        name: "السلام",
        zones: [
          {
            number: "100",
            poles: [
              { number: 1, connected: 6, moved: 1, notes: "ملاحظات حول العمود 1" },
            ]
          }
        ]
      },
    ]
  }
};
